docs/posts/2023-05-15-inductive-inference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-23 Tue 05:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Coincidence and Inductive Inference</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav>
&emsp; <a href="/index.html">Home</a>
&emsp; <a href="/about.html">About</a>
&emsp; <a href="/pubs.html">Publications</a>
&emsp; <a href="/posts.html">Posts</a>
&emsp; <a href="/posts/theindex.html">Posts by Topics</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Coincidence and Inductive Inference</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2348919">1. Crazy beard and crazy smart</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2348919" class="outline-2">
<h2 id="org2348919"><span class="section-number-2">1.</span> Crazy beard and crazy smart</h2>
<div class="outline-text-2" id="text-1">
<p>
During the pandemic, and for a term or two thereafter, I, like a lot of men, let myself grow a beard and let my hair get a bit crazy. One day when I was trying to track down a reference about something (I forget exactly what) I came across this image <a href="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.wJ0Z713Zmu1ymJu7dv45IAHaKt%26pid%3DApi&amp;f=1&amp;ipt=65c31f7f09559cc54323f891c4c0812e607b7698085d75222ca366bd551e99a7&amp;ipo=images">of Ray Solomonoff</a> and was struck by our similar hair-dos. Who was this guy? While it was the overlapping of my interests and his work that led me to the web page where the picture appeared it was the overlap of our beard aesthetics that led me to read more about him in particular. I am so glad I did.
</p>

<p>
For awhile I have been formulating my own naive ideas about why certain events seem so much more subjectively remarkable than others even though their probabilities are essentially the same. In some cases it seems value can explain it, but certainly not all. And it also seems dependent on the knowledge of the viewer. Unsurprisingly this led me to ideas of <a href="https://en.wikipedia.org/wiki/Kolmogorov_complexity">Kolmogorov complexity</a>  and algorithmic information theory <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. But while that formalism seemed to fit my needs it did not fit my viewpoint. Solomonoff's idea of the ideal inductive inference agent very much does. The family and friends of Solomonoff have a nice <a href="https://raysolomonoff.com/">website</a> in his honor and with links to papers and information. I intend to expand on Solomonoff induction in another post soon. The main point for now is the interesting and wonderful discoveries that emerge when you let eclectic interests collide with the internet's extensive archive of weird and wonderful stuff. Don't let your search be too focused. Allow the interesting distractions to win out once in awhile. 
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
By the way there is a great free course to get introduced to these ideas at <a href="https://www.edx.org/course/artificial-intelligence-algorithmic-information-aiai">https://www.edx.org/course/artificial-intelligence-algorithmic-information-aiai</a>. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-05-15 Mon 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2024-04-23 Tue 05:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
